# 2.4 Целочисленная арифметика. Часть 1
"""
Три последовательных числа

Напишите программу вывода на экран трех последовательно идущих чисел, каждое на отдельной строке. Первое число вводит пользователь, остальные числа вы должны сами вычислять в программе.

Формат входных данных
На вход программе подаётся одно целое число.

Формат выходных данных
Программа должна вывести три последовательно идущих числа в соответствии с условием задачи.

"""

num1 = int(input())

print(num1)
print(num1 + 1)
print(num1 + 2)