# 2.2 Команды print и input
"""
Звёздный треугольник ⭐

Напишите программу, которая выводит следующий треугольник, состоящий из звёздочек (*):

*
**
***
****
*****
******
*******

"""

print("*")
print("**")
print("***")
print("****")
print("*****")
print("******")
print("*******")