# 2.5 Целочисленная арифметика. Часть 2
"""
Четырёхзначное число

Напишите программу для нахождения цифр четырёхзначного числа.

Формат входных данных
На вход программе подаётся положительное четырёхзначное целое число.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

"""

num = int(input())

a = num // 1000
b = (num // 100) % 10
c = (num // 10) % 10
d = num % 10

print('Цифра в позиции тысяч равна', a)
print('Цифра в позиции сотен равна', b)
print('Цифра в позиции десятков равна', c)
print('Цифра в позиции единиц равна', d)